NextFOAM-2506/tutorials/verificationAndValidation/atmosphericModels/atmDownstreamDevelopment/setups.orig/common/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }

    ground
    {
        type            zeroGradient;
    }

    top
    {
        type            zeroGradient;
    }

    sides
    {
        type            symmetry;
    }

    outlet
    {
        type            uniformFixedValue;
        uniformValue    constant 0;
    }
}


// ************************************************************************* //
